# MEPBuildingConstructionSetIterator Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSetIterator Constructor
MEPBuildingConstructionSetIterator Class See Also
---
For Internal Use Only.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPBuildingConstructionSetIterator()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
MEPBuildingConstructionSetIterator()
```

# Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
# See Also
MEPBuildingConstructionSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace